
;=========================================Автоподогрев=========================================
autoHeatingMain:
	sbrs functionsFlags,0
	jmp autoHeatingTempChecking; автоподогрев не включен, но проверить, надо ли его включать по температуре
	;автоподогрев включен, проверить а не пора ли выключать
	;по температуре
	
	;по времени

;	ldi acc, 0x01
;	out portD, acc
	ret

autoHeatingTempChecking:

	ret

;=========================================/Автоподогрев=========================================
